while(True):
    정수 = int(input("다섯자리 정수를 입력하세요."))

    만의자리 = 정수 //10000

    if 만의자리 == 0 or 만의자리>9:

        print("다섯자리 정수를 입력하세요(10000~99999)")
        
        continue
    천의자리 = (정수-(만의자리*10000))//1000
    
    백의자리 = (정수-(만의자리*10000)-(천의자리*1000))//100

    십의자리 = (정수-(만의자리*10000)-(천의자리*1000)-(백의자리*100))//10

    일의자리 = 정수-(만의자리*10000)-(천의자리*1000)-(백의자리*100)-(십의자리*10)

    합 = 만의자리+천의자리+백의자리+십의자리+일의자리

    print(str(만의자리)+"+"+str(천의자리)+"+"+str(백의자리)+"+"+str(십의자리)+"+"+str(일의자리)+"="+str(합))

    b = input("계속하려면 아무 키나 누르세요")
